API/scripts/readme.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-11-22 Wed 08:15 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Readme</title>
<meta name="author" content="David Cuervo" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org97e67a3" class="outline-2">
<h2 id="org97e67a3">User <code>[2/9]</code></h2>
<div class="outline-text-2" id="text-org97e67a3">
</div>
<div id="outline-container-orgd475e61" class="outline-3">
<h3 id="orgd475e61"><span class="todo TODO">TODO</span> find users</h3>
<div class="outline-text-3" id="text-orgd475e61">
</div>
</div>

<div id="outline-container-orgc1704fc" class="outline-3">
<h3 id="orgc1704fc"><span class="done DONE">DONE</span> find user</h3>
<div class="outline-text-3" id="text-orgc1704fc">
</div>
</div>

<div id="outline-container-org89882ec" class="outline-3">
<h3 id="org89882ec"><span class="done DONE">DONE</span> create user</h3>
<div class="outline-text-3" id="text-org89882ec">
<div class="org-src-container">
<pre class="src src-shell">  curl -i -X POST -H "Content-Type: application/json" \
  -d '{
    "username":"postman",
    "firstname":"Post",
    "lastname":"Man",
    "email":"postman@mail.com",
    "password":"postpassword1234",
    "password2":"postpassword1234"
}' \
  http://172.27.176.1:8081/api/v0/user/create.html
</pre>
</div>
</div>
</div>

<div id="outline-container-org96b7510" class="outline-3">
<h3 id="org96b7510"><span class="todo TODO">TODO</span> update user</h3>
<div class="outline-text-3" id="text-org96b7510">
</div>
</div>

<div id="outline-container-orgb26e9e1" class="outline-3">
<h3 id="orgb26e9e1"><span class="todo TODO">TODO</span> delete user</h3>
<div class="outline-text-3" id="text-orgb26e9e1">
</div>
</div>

<div id="outline-container-org403aa0d" class="outline-3">
<h3 id="org403aa0d"><span class="todo TODO">TODO</span> authenticate</h3>
<div class="outline-text-3" id="text-org403aa0d">
<div class="org-src-container">
<pre class="src src-shell">curl -i -X GET -u admuser:secret http://172.29.0.1:8081/api/v0/user/authenticate.html
</pre>
</div>
</div>
</div>

<div id="outline-container-org80de5e4" class="outline-3">
<h3 id="org80de5e4"><span class="todo TODO">TODO</span> email validation</h3>
<div class="outline-text-3" id="text-org80de5e4">
</div>
</div>
<div id="outline-container-orgfa3ee8a" class="outline-3">
<h3 id="orgfa3ee8a"><span class="todo TODO">TODO</span> request password recovery</h3>
<div class="outline-text-3" id="text-orgfa3ee8a">
</div>
</div>
<div id="outline-container-org8b26d43" class="outline-3">
<h3 id="org8b26d43"><span class="todo TODO">TODO</span> password recovery</h3>
<div class="outline-text-3" id="text-org8b26d43">
</div>
</div>
</div>

<div id="outline-container-org601745d" class="outline-2">
<h2 id="org601745d">Group</h2>
</div>
</div>
</body>
</html>